Parikshith123-glitch/code_dump/all files of pic32 and pic16/my_project/Assignment_2(Timers, Interrupts)/4_demo_2_timer_LED_blink.X/main.c

// PIC32MZ2048EFH064 Configuration Bit Settings

// 'C' source line config statements

// DEVCFG3
#pragma config USERID = 0xFFFF          // Enter Hexadecimal value (Enter Hexadecimal value)
#pragma config FMIIEN = ON              // Ethernet RMII/MII Enable (MII Enabled)
#pragma config FETHIO = ON              // Ethernet I/O Pin Select (Default Ethernet I/O)
#pragma config PGL1WAY = ON             // Permission Group Lock One Way Configuration (Allow only one reconfiguration)
#pragma config PMDL1WAY = ON            // Peripheral Module Disable Configuration (Allow only one reconfiguration)
#pragma config IOL1WAY = ON             // Peripheral Pin Select Configuration (Allow only one reconfiguration)
#pragma config FUSBIDIO = ON            // USB USBID Selection (Controlled by the USB Module)

// DEVCFG2
#pragma config FPLLIDIV = DIV_2         // System PLL Input Divider (2x Divider)
#pragma config FPLLRNG = RANGE_5_10_MHZ // System PLL Input Range (5-10 MHz Input)
#pragma config FPLLICLK = PLL_FRC       // System PLL Input Clock Selection (FRC is input to the System PLL)
#pragma config FPLLMULT = MUL_100       // System PLL Multiplier (PLL Multiply by 100)
#pragma config FPLLODIV = DIV_4         // System PLL Output Clock Divider (4x Divider)
#pragma config UPLLFSEL = FREQ_24MHZ    // USB PLL Input Frequency Selection (USB PLL input is 24 MHz)

// DEVCFG1
#pragma config FNOSC = SPLL             // Oscillator Selection Bits (System PLL)
#pragma config DMTINTV = WIN_127_128    // DMT Count Window Interval (Window/Interval value is 127/128 counter value)
#pragma config FSOSCEN = OFF            // Secondary Oscillator Enable (Disable SOSC)
#pragma config IESO = ON                // Internal/External Switch Over (Enabled)
#pragma config POSCMOD = OFF            // Primary Oscillator Configuration (Primary osc disabled)
#pragma config OSCIOFNC = OFF           // CLKO Output Signal Active on the OSCO Pin (Disabled)
#pragma config FCKSM = CSECME           // Clock Switching and Monitor Selection (Clock Switch Enabled, FSCM Enabled)
#pragma config WDTPS = PS1048576        // Watchdog Timer Postscaler (1:1048576)
#pragma config WDTSPGM = STOP           // Watchdog Timer Stop During Flash Programming (WDT stops during Flash programming)
#pragma config WINDIS = NORMAL          // Watchdog Timer Window Mode (Watchdog Timer is in non-Window mode)
#pragma config FWDTEN = OFF             // Watchdog Timer Enable (WDT Disabled)
#pragma config FWDTWINSZ = WINSZ_25     // Watchdog Timer Window Size (Window size is 25%)
#pragma config DMTCNT = DMT31           // Deadman Timer Count Selection (2^31 (2147483648))
#pragma config FDMTEN = ON              // Deadman Timer Enable (Deadman Timer is enabled)

// DEVCFG0
#pragma config DEBUG = ON              // Background Debugger Enable (Debugger is disabled)
#pragma config JTAGEN = ON              // JTAG Enable (JTAG Port Enabled)
#pragma config ICESEL = ICS_PGx2        // ICE/ICD Comm Channel Select (Communicate on PGEC1/PGED1)
#pragma config TRCEN = ON               // Trace Enable (Trace features in the CPU are enabled)
#pragma config BOOTISA = MIPS32         // Boot ISA Selection (Boot code and Exception code is MIPS32)
#pragma config FECCCON = OFF_UNLOCKED   // Dynamic Flash ECC Configuration (ECC and Dynamic ECC are disabled (ECCCON bits are writable))
#pragma config FSLEEP = OFF             // Flash Sleep Mode (Flash is powered down when the device is in Sleep mode)
#pragma config DBGPER = PG_ALL          // Debug Mode CPU Access Permission (Allow CPU access to all permission regions)
#pragma config SMCLR = MCLR_NORM        // Soft Master Clear Enable bit (MCLR pin generates a normal system Reset)
#pragma config SOSCGAIN = GAIN_2X       // Secondary Oscillator Gain Control bits (2x gain setting)
#pragma config SOSCBOOST = ON           // Secondary Oscillator Boost Kick Start Enable bit (Boost the kick start of the oscillator)
#pragma config POSCGAIN = GAIN_2X       // Primary Oscillator Gain Control bits (2x gain setting)
#pragma config POSCBOOST = ON           // Primary Oscillator Boost Kick Start Enable bit (Boost the kick start of the oscillator)
#pragma config EJTAGBEN = NORMAL        // EJTAG Boot (Normal EJTAG functionality)

// DEVCP0
#pragma config CP = OFF                 // Code Protect (Protection Disabled)

// SEQ3
#pragma config TSEQ = 0xFFFF            // Boot Flash True Sequence Number (Enter Hexadecimal value)
#pragma config CSEQ = 0xFFFF            // Boot Flash Complement Sequence Number (Enter Hexadecimal value)

// #pragma config statements should precede project file includes.
// Use project enums instead of #define for ON and OFF.

#include <xc.h>
#include <p32xxxx.h>
#include <sys/attribs.h>

// Function declaration

void timer1_interrupt_init(void);

int main()
{
    TRISCbits.TRISC13 = 0;          // Setting the TRIx (13th bit) as output 
    TRISCbits.TRISC14 = 0;          // Setting the TRIx (13th bit) as output 
    
    timer1_interrupt_init();        // Function call
    
    while(1)
    {  

    }
    
    return 0;
}

/********************************************************************************
 * FUNCTION NAME    : timer1_interrupt_init
 * DESCRIPTION      : This function is for the initialization of timer 1 in 
 *                      in interrupt mode.
 * ARGUMENTS        : None
 * RETURNS          : void
 *******************************************************************************/

void timer1_interrupt_init(void)
{
    asm volatile("di");        // Disable Interrupts - Disables all interrupts
    asm volatile("ehb");       // Execution Hazard Barrier
    
    INTCON = 0;                // Clears the INTCON register 
    
    T1CONbits.ON = 0;          // Reset the timer
    T1CONbits.TCS = 0;         // PBCLK Clock source 
    T1CONbits.TCKPS = 3;       // Pre-scaler setting
    
    TMR1 = 0;                  // Timer Register reset
    PR1 = 0xFFFF;              // Period register set to maximum 
    
    IPC1bits.T1IP = 3;         // Setting the priority of timer 1
    IPC1bits.T1IS = 0;         // Setting the sub-priority of timer 1
    
    IFS0bits.T1IF = 0;         // Resetting the interrupt flag status bit
    IEC0bits.T1IE = 1;         // Setting the interrupt enable control flag bit
    
    T1CONbits.ON = 1;          // Start the timer
    asm volatile("ei");        // Enable Interrupts - Re-enables all interrupts
    
}

/********************************************************************************
 * FUNCTION NAME    : Timer_1_ISR_Handler
 * DESCRIPTION      : This function is the ISR for when the TMRx reaches the PRx
 *                             and generates interrupt.
 * ARGUMENTS        : None
 * RETURNS          : void
 *******************************************************************************/

void __ISR(_TIMER_1_VECTOR, IPL3)Timer_1_ISR_Handler(void) // Interrupt service routine (ISR) call
{
    LATCbits.LATC13 ^= 1;      // LED Toggle to indicate that we are inside ISR
    LATCbits.LATC14 ^= 1;      // LED Toggle to indicate that we are inside ISR

    IFS0bits.T1IF = 0;         // Resetting the interrupt flag status bit
}
